#!/bin/bash

# Цвета
RED='\033[0;31m'
NC='\033[0m' # Сброс цвета

# Проверка наличия npm
if command -v npm &> /dev/null
then
    echo "___________________________________________________"
    echo -e "\n${RED}npm установлен. Версия: $(npm -v)${NC}\n"
    echo "___________________________________________________"
else
    echo "___________________________________________________"
    echo "npm не найден. Устанавливаем..."
    echo "___________________________________________________"
    sudo apt update && sudo apt install -y npm
    echo "___________________________________________________"
    echo -e "\n${RED}npm установлен. Версия: $(npm -v)${NC}\n"
    echo "___________________________________________________"
fi
