#!/bin/bash

# Функция для определения цветов
function colors {
  NORMAL="\e[0m"  # Стандартный цвет (нейтральный)
}
colors

# Вывод текста OdaNoder в стиле ASCII-art
echo -e "${NORMAL} #   ####    ####       ##              ##  ##    ####    ####     ######   #####    #${NORMAL}"
echo -e "${NORMAL} #  ##  ##   ## ##     ####             ### ##   ##  ##   ## ##    ##       ##  ##   #${NORMAL}"
echo -e "${NORMAL} #  ##  ##   ##  ##   ##  ##            ######   ##  ##   ##  ##   #####    ##  ##   #${NORMAL}"
echo -e "${NORMAL} #  ##  ##   ##  ##   ##  ##            ######   ##  ##   ##  ##   ##       #####    #${NORMAL}"
echo -e "${NORMAL} #  ##  ##   ## ##    ######            ## ###   ##  ##   ## ##    ##       ## ##    #${NORMAL}"
echo -e "${NORMAL} #   ####    ####     ##  ##            ##  ##    ####    ####     ######   ##  ##   #${NORMAL}"
echo -e "${NORMAL} #░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░odanoder.com░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░#${NORMAL}"
